wintersmith/contents/articles/Perl/2013-06-21-Plack.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Plack 是什么</a></li>
<li><a href="#sec-2">Plack Tookit介绍</a>
<ul>
<li><a href="#sec-2-1">plackup</a></li>
<li><a href="#sec-2-2">Plack::Runner</a></li>
<li><a href="#sec-2-3">Plack::Loader</a></li>
<li><a href="#sec-2-4">Plack::Handler</a></li>
<li><a href="#sec-2-5">Palck::Middleware</a></li>
<li><a href="#sec-2-6">Plack::Builder</a></li>
</ul>
</li>
<li><a href="#sec-3">Plack/PSGI资料</a></li>
</ul>
</div>
</div>
---
date: 2013-06-21
template: tech.jade
title: Plack 介绍
category: Perl
change_frequency: monthly
---

<p>
<a href="http://search.cpan.org/~miyagawa/Plack-1.0028/lib/Plack.pm">Plack</a> - Perl Superglue for Web frameworks and Web Servers (PSGI toolkit)
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Plack 是什么</h2>
<div class="outline-text-2" id="text-1">
<p>
Plack 是PSGI协议的实现，还包括额外的功能。Plack与PSGI是同一个人做的。
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Plack Tookit介绍</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">plackup</h3>
<div class="outline-text-3" id="text-2-1">
<p>
plackup 是一个命令行程序，用来启动和运行plack程序，包括加载app、启动Plack Server、加载中间件等。plackup 使用Plack::Runner完成这些。
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Plack::Runner</h3>
<div class="outline-text-3" id="text-2-2">
<p>
运行Plack程序，即进行加载程序、启动Server、加载中间件等。
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Plack::Loader</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Plack Server handler 加载程序，可以自动根据环境加载不同的Plack Server handler，plack server handler包括：
</p>
<ul class="org-ul">
<li>PSGI - PSGI 实现
</li>
<li>Twiggy - AnyEvent PSGI实现
</li>
<li>Corona - Coro PSGI实现
</li>
<li>POE
</li>
<li>CGI
</li>
<li>FCGI
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Plack::Handler</h3>
<div class="outline-text-3" id="text-2-4">
<p>
这些是Plack app与webserver的接口程序，根据同步的web server 分别有：
</p>
<ul class="org-ul">
<li>Apache
</li>
<li>FCGI - fastcgi
</li>
<li>CGI
</li>
<li>PSGI
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">Palck::Middleware</h3>
<div class="outline-text-3" id="text-2-5">
<p>
中间件，PSGI中间件模块，位于PSGI server与PSGI app之间，实现上对PSGI app进行wrapper
</p>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6">Plack::Builder</h3>
<div class="outline-text-3" id="text-2-6">
<p>
app builder, 可以使用它的方法builder 使用middlware对app进行wrapper，创建新的app
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Plack/PSGI资料</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Plack作者YAPC上的Plack介绍
<div>
<button onclick="javascript: show_ppt(this)" class="pure-button">查看(view)</button>
</div>
<div class="mask" onclick="javascript: hide_ppt(this)"></div>
<div class="mask_container">
<iframe src="https://docs.google.com/file/d/0B8Zm-qV7M9pISmtrNnNSRHRrX3c/preview" width="100%" height="100%">
</iframe>
</div>
</li>
<li>YAPC上另一份关于Plack的介绍
<div>
<button onclick="javascript: show_ppt(this)" class="pure-button">查看(view)</button>
</div>
<div class="mask" onclick="javascript: hide_ppt(this)"></div>
<div class="mask_container">
<iframe src="https://docs.google.com/file/d/0B8Zm-qV7M9pIWTN6T0RhRFhUdU0/preview" width="100%" height="100%">
</iframe>
</div>
</li>
</ul>
</div>
</div>
